wms_mobile/src/DataProcessors/униПроверкаПоШтрихкоду/униПроверкаПоШтрихкоду.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>униПроверкаПоШтрихкоду</name>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>160</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инфо</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнфоДоп</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьКороба</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьФСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьИнфоДоп</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФлагВыполненияЗапроса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Палеты</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>26</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Короба</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>26</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>26</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЕдиницыАП</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>26</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

wms_mobile/src/DataProcessors/униПроверкаПоШтрихкоду/ObjectModule.bsl
Функция ПолучитьТипШтрихкодаНаСервере(Стр) Экспорт
	Если СтрДлина(СокрЛП(Стр)) = 18 Тогда
		ТипШтрихКода=1; //Палет
	ИначеЕсли СтрДлина(СокрЛП(Стр)) = 20 Тогда
		Если Лев(СокрЛП(ШтрихКод),2) ="00" Тогда
			ТипШтрихКода=1; //Палет
		КонецЕсли; 
	ИначеЕсли СтрДлина(СокрЛП(Стр)) = 26 Тогда
		Если Сред(СокрЛП(Стр),13,1) ="2" или Сред(СокрЛП(Стр),13) ="4"  Тогда
			ТипШтрихКода=1; //Палет
		ИначеЕсли Сред(СокрЛП(Стр),13,1) ="1" или Сред(СокрЛП(Стр),13) ="3"  Тогда
			ТипШтрихКода=2; //Короб
		КонецЕсли; 
	ИначеЕсли СтрДлина(СокрЛП(Стр)) = 68 Тогда
		Если Лев(СокрЛП(Стр),3) ="22N"   Тогда
			ТипШтрихКода=3; //Бутылка
		КонецЕсли; 
	ИначеЕсли СтрДлина(СокрЛП(Стр)) = 150 Тогда
		ТипШтрихКода=3; //Бутылка
	Иначе
		ТипШтрихКода=0; //Неправильный штрихкод
	КонецЕсли;
	Возврат ТипШтрихКода;
КонецФункции

Процедура ПолучитьИнформациюПоШтрихКодуНаСервере() Экспорт
	ФлагВыполненияЗапроса=Истина;
    ФСтр = ШтрихКод;
 
  	СтруктураЗапроса = униОбщийМодуль.НоваяСтруктураЗапросакUWS("300000010");
	СтруктураЗапроса.Вставить("ШтрихКод",ШтрихКод);

	СтруктураЗапроса.Вставить("ИмяМетода","ПолучитьИнформациюПоШтрихКоду");

	Попытка
		ОтветСервера =  униОбщийМодуль.ДанныеИзUWS(СтруктураЗапроса);
	Исключение
		УспехАвторизации = Ложь;
		ОтветСервера = "Ошибка";
		сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
	ЕдиницыАП.Очистить();
	Палеты.Очистить();
	Короба.Очистить();
	ПоказыватьИнфоДоп=Ложь;
	Если ТипЗнч(ОтветСервера) = Тип("Структура") Тогда
		Если ОтветСервера.Свойство("Короба") Тогда
			Короба.Загрузить(ОтветСервера.Короба);
			 КонецЕсли;
		Если ОтветСервера.Свойство("ЕдиницыАП") Тогда
			ЕдиницыАП.Загрузить(ОтветСервера.ЕдиницыАП);
		КонецЕсли;
		Если ОтветСервера.Свойство("Инфо") Тогда
			Инфо=ОтветСервера.Инфо;
		КонецЕсли;
		Если ОтветСервера.Свойство("ИнфоДоп") Тогда
			ИнфоДоп=ОтветСервера.ИнфоДоп;
			ПоказыватьИнфоДоп=Истина;
		КонецЕсли;
		Если ОтветСервера.Свойство("ПоказыватьКороба") Тогда
			ПоказыватьКороба=ОтветСервера.ПоказыватьКороба;
		КонецЕсли;
		Если ОтветСервера.Свойство("ПоказыватьКороба") Тогда
			ПоказыватьФСМ=ОтветСервера.ПоказыватьФСМ;
		КонецЕсли;
	КонецЕсли;
	ФлагВыполненияЗапроса=Ложь;
КонецПроцедуры
